HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDmu_reg.h
/** \brief 10300, PFLASH Bank 3 Protection Configuration 0 */
#define DMU_HP3_PROCON_P0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P0*)0xF8050300u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_P0.
* To use register names with standard convension, please use DMU_HP3_PROCON_P0.
*/
#define DMU_HP_PROCONP30 (DMU_HP3_PROCON_P0)

/** \brief 10304, PFLASH Bank 3 Protection Configuration 1 */
#define DMU_HP3_PROCON_P1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P1*)0xF8050304u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_P1.
* To use register names with standard convension, please use DMU_HP3_PROCON_P1.
*/
#define DMU_HP_PROCONP31 (DMU_HP3_PROCON_P1)

/** \brief 10308, PFLASH Bank 3 Protection Configuration 2 */
#define DMU_HP3_PROCON_P2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P2*)0xF8050308u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_P2.
* To use register names with standard convension, please use DMU_HP3_PROCON_P2.
*/
#define DMU_HP_PROCONP32 (DMU_HP3_PROCON_P2)

/** \brief 1030C, PFLASH Bank 3 Protection Configuration 3 */
#define DMU_HP3_PROCON_P3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P3*)0xF805030Cu)
/** Alias (User Manual Name) for DMU_HP3_PROCON_P3.
* To use register names with standard convension, please use DMU_HP3_PROCON_P3.
*/
#define DMU_HP_PROCONP33 (DMU_HP3_PROCON_P3)

/** \brief 10310, PFLASH Bank 3 Protection Configuration 4 */
#define DMU_HP3_PROCON_P4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P4*)0xF8050310u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_P4.
* To use register names with standard convension, please use DMU_HP3_PROCON_P4.
*/
#define DMU_HP_PROCONP34 (DMU_HP3_PROCON_P4)

/** \brief 10314, PFLASH Bank 3 Protection Configuration 5 */
#define DMU_HP3_PROCON_P5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P5*)0xF8050314u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_P5.
* To use register names with standard convension, please use DMU_HP3_PROCON_P5.
*/
#define DMU_HP_PROCONP35 (DMU_HP3_PROCON_P5)

/** \brief 10340, PFLASH Bank 3 OTP Protection Configuration 0 */
#define DMU_HP3_PROCON_OTP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP0*)0xF8050340u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_OTP0.
* To use register names with standard convension, please use DMU_HP3_PROCON_OTP0.
*/
#define DMU_HP_PROCONOTP30 (DMU_HP3_PROCON_OTP0)

/** \brief 10344, PFLASH Bank 3 OTP Protection Configuration 1 */
#define DMU_HP3_PROCON_OTP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050344u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_OTP1.
* To use register names with standard convension, please use DMU_HP3_PROCON_OTP1.
*/
#define DMU_HP_PROCONOTP31 (DMU_HP3_PROCON_OTP1)

/** \brief 10348, PFLASH Bank 3 OTP Protection Configuration 2 */
#define DMU_HP3_PROCON_OTP2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050348u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_OTP2.
* To use register names with standard convension, please use DMU_HP3_PROCON_OTP2.
*/
#define DMU_HP_PROCONOTP32 (DMU_HP3_PROCON_OTP2)

/** \brief 1034C, PFLASH Bank 3 OTP Protection Configuration 3 */
#define DMU_HP3_PROCON_OTP3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805034Cu)
/** Alias (User Manual Name) for DMU_HP3_PROCON_OTP3.
* To use register names with standard convension, please use DMU_HP3_PROCON_OTP3.
*/
#define DMU_HP_PROCONOTP33 (DMU_HP3_PROCON_OTP3)

/** \brief 10350, PFLASH Bank 3 OTP Protection Configuration 4 */
#define DMU_HP3_PROCON_OTP4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050350u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_OTP4.
* To use register names with standard convension, please use DMU_HP3_PROCON_OTP4.
*/
#define DMU_HP_PROCONOTP34 (DMU_HP3_PROCON_OTP4)

/** \brief 10354, PFLASH Bank 3 OTP Protection Configuration 5 */
#define DMU_HP3_PROCON_OTP5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050354u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_OTP5.
* To use register names with standard convension, please use DMU_HP3_PROCON_OTP5.
*/
#define DMU_HP_PROCONOTP35 (DMU_HP3_PROCON_OTP5)

/** \brief 10380, PFLASH Bank 3 WOP Configuration 0 */
#define DMU_HP3_PROCON_WOP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050380u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_WOP0.
* To use register names with standard convension, please use DMU_HP3_PROCON_WOP0.
*/
#define DMU_HP_PROCONWOP30 (DMU_HP3_PROCON_WOP0)

/** \brief 10384, PFLASH Bank 3 WOP Configuration 1 */
#define DMU_HP3_PROCON_WOP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050384u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_WOP1.
* To use register names with standard convension, please use DMU_HP3_PROCON_WOP1.
*/
#define DMU_HP_PROCONWOP31 (DMU_HP3_PROCON_WOP1)

/** \brief 10388, PFLASH Bank 3 WOP Configuration 2 */
#define DMU_HP3_PROCON_WOP2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050388u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_WOP2.
* To use register names with standard convension, please use DMU_HP3_PROCON_WOP2.
*/
#define DMU_HP_PROCONWOP32 (DMU_HP3_PROCON_WOP2)

/** \brief 1038C, PFLASH Bank 3 WOP Configuration 3 */
#define DMU_HP3_PROCON_WOP3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805038Cu)
/** Alias (User Manual Name) for DMU_HP3_PROCON_WOP3.
* To use register names with standard convension, please use DMU_HP3_PROCON_WOP3.
*/
#define DMU_HP_PROCONWOP33 (DMU_HP3_PROCON_WOP3)

/** \brief 10390, PFLASH Bank 3 WOP Configuration 4 */
#define DMU_HP3_PROCON_WOP4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050390u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_WOP4.
* To use register names with standard convension, please use DMU_HP3_PROCON_WOP4.
*/
#define DMU_HP_PROCONWOP34 (DMU_HP3_PROCON_WOP4)

/** \brief 10394, PFLASH Bank 3 WOP Configuration 5 */
#define DMU_HP3_PROCON_WOP5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050394u)
/** Alias (User Manual Name) for DMU_HP3_PROCON_WOP5.
* To use register names with standard convension, please use DMU_HP3_PROCON_WOP5.
*/
#define DMU_HP_PROCONWOP35 (DMU_HP3_PROCON_WOP5)

/** \brief 103A0, PFLASH Bank 3 Erase Counter Priority configuration 0 */
#define DMU_HP3_ECPRIO_P0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P0*)0xF80503A0u)
/** Alias (User Manual Name) for DMU_HP3_ECPRIO_P0.
* To use register names with standard convension, please use DMU_HP3_ECPRIO_P0.
*/
#define DMU_HP_ECPRIO30 (DMU_HP3_ECPRIO_P0)

/** \brief 103A4, PFLASH Bank 3 Erase Counter Priority Configuration 1 */
#define DMU_HP3_ECPRIO_P1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P1*)0xF80503A4u)
/** Alias (User Manual Name) for DMU_HP3_ECPRIO_P1.
* To use register names with standard convension, please use DMU_HP3_ECPRIO_P1.
*/
#define DMU_HP_ECPRIO31 (DMU_HP3_ECPRIO_P1)

/** \brief 103A8, PFLASH Bank 3 Erase Counter Priority Configuration 2 */
#define DMU_HP3_ECPRIO_P2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P2*)0xF80503A8u)
/** Alias (User Manual Name) for DMU_HP3_ECPRIO_P2.
* To use register names with standard convension, please use DMU_HP3_ECPRIO_P2.
*/
#define DMU_HP_ECPRIO32 (DMU_HP3_ECPRIO_P2)

/** \brief 103AC, PFLASH Bank 3 Erase Counter Priority Configuration 3 */
#define DMU_HP3_ECPRIO_P3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P3*)0xF80503ACu)
/** Alias (User Manual Name) for DMU_HP3_ECPRIO_P3.
* To use register names with standard convension, please use DMU_HP3_ECPRIO_P3.
*/
#define DMU_HP_ECPRIO33 (DMU_HP3_ECPRIO_P3)

/** \brief 103B0, PFLASH Bank 3 Erase Counter Priority Configuration 4 */
#define DMU_HP3_ECPRIO_P4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P4*)0xF80503B0u)
/** Alias (User Manual Name) for DMU_HP3_ECPRIO_P4.
* To use register names with standard convension, please use DMU_HP3_ECPRIO_P4.
*/
#define DMU_HP_ECPRIO34 (DMU_HP3_ECPRIO_P4)

/** \brief 103B4, PFLASH Bank 3 Erase Counter Priority Configuration 5 */
#define DMU_HP3_ECPRIO_P5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P5*)0xF80503B4u)
/** Alias (User Manual Name) for DMU_HP3_ECPRIO_P5.
* To use register names with standard convension, please use DMU_HP3_ECPRIO_P5.
*/
#define DMU_HP_ECPRIO35 (DMU_HP3_ECPRIO_P5)

/** \brief 20010, HSM Flash Status Register */
#define DMU_SF_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_SF_STATUS*)0xF8060010u)

